In [1]:
import importlib
import p_plp.db
import p_plp.db.utils
from p_plp.db import *
from p_plp.cohorts import *
from p_plp.feature_engineering import *
importlib.reload(p_plp.db.utils)
dir(p_plp.db.utils)

['CDM_SCHEMA',
 'CdmTable',
 'Enum',
 'WORK_SCHEMA',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__file__',
 '__loader__',
 '__name__',
 '__package__',
 '__spec__',
 'fetch_df',
 'get_cdm_table',
 'list_cdm_tables',
 'list_tables',
 'list_work_tables',
 'pd',
 'run_sql',
 'text']

In [2]:
engine = get_engine()
list_observed_conditions(engine).head()

   concept_id             concept_name vocabulary_id  n_occurrences
0     4281516               Gingivitis        SNOMED            264
1      133228            Dental caries        SNOMED            115
2    40481087          Viral sinusitis        SNOMED            108
3     4112343  Acute viral pharyngitis        SNOMED             73
4      260139         Acute bronchitis        SNOMED             66

In [3]:
generate_target_cohort(engine, 133228).head()

   subject_id cohort_start_date cohort_end_date
0         107        1973-01-02      1973-01-02
1           1        1980-06-12      1980-06-12
2         108        1981-10-11      1981-10-11
3          67        1983-04-05      1983-04-05
4         100        1984-10-01      1984-10-01

In [4]:
list_observed_outcomes(engine).head()

   concept_id             concept_name vocabulary_id  n_occurrences
0     4281516               Gingivitis        SNOMED            264
1      133228            Dental caries        SNOMED            115
2    40481087          Viral sinusitis        SNOMED            108
3     4112343  Acute viral pharyngitis        SNOMED             73
4      260139         Acute bronchitis        SNOMED             66

In [5]:
generate_outcome_cohort(engine, 40481087).head()

   subject_id cohort_start_date cohort_end_date
0          63        1989-01-15      1989-01-15
1         117        1989-03-12      1989-03-12
2          86        1990-03-03      1990-03-03
3          66        1997-03-30      1997-03-30
4          82        1999-06-02      1999-06-02

In [6]:
generate_labels_time_at_risk(engine).sort_values(by=["subject_id"])

,subject_id,index_date,tar_start_date,tar_end_date,outcome_flag,outcome_date
1,1,1980-06-12,1980-06-13,1989-08-29,0,2001-06-09
9,2,1991-05-10,1991-05-11,2000-07-26,0,2017-05-19
43,3,2013-06-16,2013-06-17,2022-09-02,0,None
18,9,1998-08-20,1998-08-21,2007-11-06,0,2022-05-11
12,10,1994-11-09,1994-11-10,2004-01-26,0,None
...,...,...,...,...,...,...
2,108,1981-10-11,1981-10-12,1990-12-28,0,None
56,110,2019-08-09,2019-08-10,2028-10-25,1,2020-08-21
50,112,2015-09-12,2015-09-13,2024-11-28,1,2020-12-10
13,116,1995-02-15,1995-02-16,2004-05-03,0,2016-07-16
51,118,2016-01-26,2016-01-27,2025-04-13,1,2016-04-01

In [7]:
list_work_tables(engine)

       table_name
0          labels
1  outcome_cohort
2   target_cohort

In [8]:
build_demographic_features(engine)
df_demo = get_demographic_features(engine)
df_demo.head()

   subject_id  age  gender_concept_id
0           1    2               8532
1           2    9               8507
2           3   46               8507
3           9   40               8532
4          10   39               8507

In [19]:
build_prior_condition_count_features(engine, lookback_days=365)
df_cond = get_prior_condition_count_features(engine)
df_cond.sort_values(by=["n_prior_conditions"],ascending=False).head()

    subject_id  n_prior_conditions
15          28                   4
9           17                   4
42          72                   4
51          88                   4
66         110                   3